Revit 2027 API
AssetPropertyDoubleArray4d.IsValidValue(IList<Double>) Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	IList<double> value
)
Public Function IsValidValue (
	value As IList(Of Double)
) As Boolean
public:
bool IsValidValue(
	IList<double>^ value
)
member IsValidValue :
        value : IList<float> -> bool
Parameters
value IList<Double>
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyDoubleArray4d Class
IsValidValue Overload
Autodesk.Revit.DB.Visual Namespace